{
    "1d2013e7-baa2-4f99-bd47-36de708e00f5": {
        "title": "DevOps Databricks Engineer - Azure @ Remote",
        "location": "US",
        "company": "Aroha Technologies",
        "link": "https://www.dice.com/job-detail/1d2013e7-baa2-4f99-bd47-36de708e00f5",
        "isApplied": false,
        "description": "Position:1 \n \nDatabricks Platform/DevOps Engineer \n \n- 1 position \nJob Description (JD): \n \nExperience: \n \n12+ years \n \nSkills Required: \n \nDatabricks/Azure admin/Azure DevOps \n \nGit/Git-Actions \n \nTerraform \n \nExperience in setting up CI/CD \n \nExperience in Azure services admin (ADF, Logic Apps, Blob, ADLS, Key-Vault, etc.) \n \nExperience in Databricks admin (Workspaces, Unity Catalog, Volumes, Ext volumes, etc.) \n",
        "datePosted": 1721504740,
        "dateUpdated": 1721504740
    },
    "07c74830-9198-449d-b33b-ee182fbfcfa5": {
        "title": "100% Remote - Sr Salesforce Engineer",
        "location": "Remote",
        "company": "Beacon Hill",
        "link": "https://www.dice.com/job-detail/07c74830-9198-449d-b33b-ee182fbfcfa5",
        "isApplied": false,
        "description": "NOTE: This is a 100% remote position. Candidates will be working on CST Timezone. \n \nOne of our clients in Appleton, Wisconsin is looking for a Senior Salesforce Engineer with the following skills and experience: \n \nThis is a Senior Salesforce Engineer role with a focus on exceptional communication, technical proficiency, and industry-specific experience, particularly in financial products and services. \nMust-Have Requirements: \n \nSalesforce CRM Expertise: \n \nExtensive experience with Salesforce CRM, particularly in building differentiated experiences using Lightning Web Components (LWC), Apex, REST APIs, and Flows. \n \nCoding Practices: \n \nStrong understanding of good coding practices, including code coverage, monitoring/observability, and secure coding. \n \nInitiative and Proactiveness: \n \nAbility to take initiative and not wait for instructions. \n \nCommunication and Collaboration: \n \nExceptional communication skills, capable of discussing, debating, and moving on collaboratively. \n \nDevOps Understanding: \n \nProficiency with DevOps practices and tools, including GitHub and CI/CD pipelines. \n \nSalesforce Tech Updates: \n \nKeeps up-to-date with the latest Salesforce technologies and tools. \n \nNice-to-Have Requirements: \n \nSalesforce Financial Services Cloud: \n \nExperience with Salesforce Financial Services Cloud, although not mandatory. \n \nMessaging Software: \n \nFamiliarity with messaging tools like Kafka and RabbitMQ. \n \nJava/OpenShift: \n \nExperience with Java and OpenShift. \n \nDesign Experience: \n \nBackground in design and ability to contribute to design processes. \n \nTest Automation: \n \nKnowledge of test automation tools like Selenium and Playwright. \n \nAdditional Insights: \n \nLook for candidates with diverse coding language experience, especially Java or JavaScript. \n \nExperience with Salesforce DX and developer tools. \n \nHeavily integrated with other applications. \n \nDemonstrated technical thought leadership through blogs, posts, or GitHub contributions. \n \n3+ years of specific Salesforce experience, with an overall 5+ years of professional experience. \n \nInterested candidates may submit their resumes online or call at  for further information regarding the position. \nBeacon Hill is an Equal Opportunity Employer that values the strength diversity brings to the workplace. Individuals with Disabilities and Protected Veterans are encouraged to apply. \nIf you would like to complete our voluntary self-identification form, please  or copy and paste the following link into an open window in your browser: ;/p> \n \nCompletion of this form is voluntary and will not affect your opportunity for employment, or the terms or conditions of your employment. This form will be used for reporting purposes only and will be kept separate from all other records. \n \nCompany Profile: \n \nBeacon Hill Technologies, a premier National Information Technology Staffing Group, provides world class technology talent across all industries utilizing a complete suite of staffing services.  Beacon Hill Technologies' dedicated team of recruiting and staffing experts consistently delivers quality IT professionals to solve our customers' technical and business needs. \n \nBeacon Hill Technologies covers a broad spectrum of IT positions, including Project Management and Business Analysis, Programming/Development, Database, Infrastructure, Quality Assurance, Production/Support and ERP roles. \n \nLearn more about Beacon Hill Staffing Group and our specialty divisions, Beacon Hill Associates, Beacon Hill Financial, Beacon Hill HR, Beacon Hill Legal, Beacon Hill Life Sciences and Beacon Hill Technologies by visiting . \n \nWe look forward to working with you. \n \nBeacon Hill. Employing the Future \n",
        "datePosted": 1721448537,
        "dateUpdated": 1721505965
    }
}