{
    "e1322a6c-4ac4-4e69-8b1a-f3a7c4c6b1e7": {
        "title": "Sr. DevOps Engineer",
        "location": "Los Angeles, California, USA",
        "company": "Jobot",
        "link": "https://www.dice.com/job-detail/e1322a6c-4ac4-4e69-8b1a-f3a7c4c6b1e7",
        "isApplied": "no",
        "description": "Hybrid DevOps Engineer role with a well-know entertainment company in Los Angeles \nThis Jobot Consulting Job is hosted by: Brittany Salvato \nAre you a fit? Easy Apply now by clicking the \"Apply Now\" button and sending us your resume. \nSalary: $65 - $85 per hour \nA bit about us: \nWell-known entertainment client with excellent beneits \nWhy join us? \nExcellent benefits \nJob Details \nJob Details: \nWe are seeking a dynamic and experienced Senior DevOps Engineer to join our innovative technology team on a contract to hire basis. The ideal candidate will be a seasoned professional with a deep understanding of DevOps methodologies, Git, Azure AKS, ASK, Bash scripting, Bash, Python, PowerShell, Azure Cloud Services, CosmosDB, VNET, Github, GitFlow, and GitHub Actions. If you are an individual who loves to be at the forefront of technology, solving complex problems, and driving operational efficiency, then we want you on our team! \nResponsibilities: \nAs a Consulting Sr. DevOps Engineer, you will: \n1. Drive the company's DevOps strategy by analyzing, designing, implementing, and maintaining our deployment and operations infrastructure. \n2. Collaborate with software engineers to understand application requirements, identify solutions, and ensure smooth integration and operation. \n3. Automate and streamline our operations and processes to improve speed, efficiency, and scalability using Bash scripting, Python, and PowerShell. \n4. Manage and maintain Azure Cloud Services, CosmosDB, and VNET to ensure optimal performance and security. \n5. Use Git, Github, GitFlow, and GitHub Actions for version control, code review, and continuous integration. \n6. Implement and manage Azure AKS and ASK for container orchestration. \n7. Troubleshoot and resolve issues in our development, test, and production environments. \n8. Develop and maintain detailed documentation of all systems, processes, and procedures. \n9. Keep up-to-date with the latest industry trends and technologies to ensure we remain competitive. \nQualifications: \nTo be successful in this role, you will need: \n1. A minimum of 5 years of experience in a DevOps role in the technology industry. \n2. In-depth knowledge and experience with DevOps, Git, Azure AKS, ASK, Bash scripting, Bash, Python, PowerShell, Azure Cloud Services, CosmosDB, VNET, Github, GitFlow, and GitHub Actions. \n3. Strong experience in automating, configuring, and deploying instances on Azure Cloud Services and working with Azure AKS and ASK. \n4. Excellent problem-solving skills with the ability to analyze complex data, identify core issues, investigate, evaluate and reach appropriate conclusions/solutions. \n5. Strong written and verbal communication skills, with the ability to explain complex technical concepts to a non-technical audience. \n6. A bachelor's degree in Computer Science, Information Technology, or a related field is preferred. \n7. Relevant industry certifications such as Microsoft Certified: Azure DevOps Engineer Expert or similar would be advantageous. \nJoin us and be a part of a forward-thinking company that values innovation, creativity, and the contribution of every team member. We look forward to welcoming you to our team! \nInterested in hearing more? Easy Apply now by clicking the \"Apply Now\" button."
    },
    "cb583d72-a713-4af4-b7dd-e9c305042a70": {
        "title": "Cloud DevOps Engineer :; Mt Laurel, NJ or New York, NY  :: HYbrid",
        "location": "Mount Laurel Township, New Jersey, USA",
        "company": "Data Wave Technologies Inc",
        "link": "https://www.dice.com/job-detail/cb583d72-a713-4af4-b7dd-e9c305042a70",
        "isApplied": "no",
        "description": "Lead Cloud DevSec Ops Engineer \n \nMt Laurel, NJ or New York, NY (2 days/week onsite) \n \nW2/Fulltime \n \nRequired: \n \nEnsure that all cloud solutions follow internally defined security and compliance controls. \n \nImplement the enterprise cloud capability and enhance the cloud orchestration platform for automated provisioning, management and scalability of hosts, containers, applications, and cloud services (AquaSec, Wiz.io, Defender, Sentinel, Google Chronicle, Splunk, etc.) \n \nDevelop APIs and Webhook for multi-directional integration of cloud orchestration platform with system management systems, DevOps Tools, and cloud platforms. \n \nData transformation and reporting for security compliance KPI/ KRIs \n \nIntegration of security tooling in enterprise deployment pipelines for developer feedback and runtime governance \n \nIntegration of security reporting with SIEM and incorporation with Enterprise Monitoring procedures \n \nParticipate in fast-paced DevOps Engineering teams within Scrum agile processes. \n \n7+ years of automation and IT experience. 2+ years in DevOps and cloud experience. \n \nExperience with Google Org Policy. \n \nStrong programming skill with experience in API and Webhook development using Python, PowerShell, and Rego. \n \nExperience with automating and integrating serverless PaaS solutions in Azure and Google Cloud Platform platforms. \n \nDeep knowledge of Container security and orchestration. Experience with compliance and application security tools. \n \nUnderstand Cloud (Azure/ Google Cloud Platform) security features (data protection, IAM, network security, compliance frameworks) \n \nAbility to troubleshoot Network, DNS, Firewall, and routing. \n \nUnderstand and develop concepts related to deploying services via CI/CD pipeline. \n \nExperience with creation of automated workflows using Terraform (Sentinel) and GitHub actions."
    },
    "f48694ca-e50d-443e-a5b1-2a11888127fd": {
        "title": "DevOps Engineer",
        "location": "Remote",
        "company": "Proventus Metrics",
        "link": "https://www.dice.com/job-detail/f48694ca-e50d-443e-a5b1-2a11888127fd",
        "isApplied": "no",
        "description": "Hi \n \nPosition: DevOps Engineer \n \nLocation: Austin, Texas \n \nDuration: Long Term \n \n15 years of profiles consider only \n \nProfessional experience in DevOps engineering, Software Development, or related field \n \nExperience with programming languages such as Java and .NET \n \nExperience with scripting languages such as Bash, Python, and PowerShell to automate repetitive tasks such as monitoring, deployments, and configuration management \n \nExperience in Cybersecurity and implementing and automating security best practices into CI/CD pipelines \n \nExperience with security testing tools such as SAST, DAST, or IAST \n \nExperience setting up and managing Jenkins servers, creating and maintaining CI/CD pipelines, integrating with other tools (e.g., Git, Maven, SonarQube), writing Groovy scripts for pipeline automation, and monitoring and optimizing Jenkins performance. \n \nExperience with Infrastructure as Code tools like Ansible, Terraform, or Chef \n \nExperience with containerization and orchestration tools such as Docker and Kubernetes \n \nExperience with automation of infrastructure provisioning and configuration management \n \nExperience with Maven in building and managing Java projects, maintaining POM files, troubleshooting build issues, dependency management and versioning, and integrating with CI/CD pipelines \n \nExperience with Artifactory set up, configuration, managing binary repositories, integrating with build tools (e.g., Maven and Jenkins), managing artifact lifecycle and versioning, and implementing security and access controls. \n \nExperience with microservices architecture, design, development and containerization and orchestration \n \nExperience with SQL and NoSQL databases \n \nExperience designing, developing, testing, integrating, and implementing secure REST APIs \n \nExperience with code reviews and in-depth code analysis \n \nExperience with highly complex application security requirements \n \nExperience with Git, Bitbucket, Subversion and version control systems \n \nExperience with SonarQube set up, configuration, integrating with CI/CD pipelines, and analyzing code quality and security vulnerabilities \n \nExperience with Jira and Confluence \n \nExperience with Agile teams \n \nExperience with coaching, training, mentoring and knowledge transfer \n \nExperience with cloud technologies and platforms such as AWS and Azure \n \nExperience working with legacy applications/services \n \nExperience in modern web technologies such as JavaScript, Node.js, React.js, Redux, HTML5, CSS3 \n \nPublic sector experience (Federal, State or Local Government) \n \nProficient with the Microsoft Office products, including Outlook, TEAMS, Microsoft Project, Word, Visio, Excel and PowerPoint \n"
    },
    "8b7f4f50-5dde-4701-ae08-39fd43eb7a22": {
        "title": "DevOps Engineer",
        "location": "Manassas, Virginia, USA",
        "company": "Ajace Inc",
        "link": "https://www.dice.com/job-detail/8b7f4f50-5dde-4701-ae08-39fd43eb7a22",
        "isApplied": "no",
        "description": "Job Description \n \nWe are looking for a DevOps Engineer to join our client and Manassas, VA to work as our W2 candidate.   The ideal candidate will have a strong background in continuous integration and continuous deployment (CI/CD) using Jenkins, infrastructure as code (IaC), Kubernetes, cloud, and container technologies. Additionally, programming skills in Python or Java, and deployment automation experience are crucial for this role. A good understanding of Red Hat Enterprise Linux (RHEL) and vCenter API experience is also required. This role involves product testing to ensure our solutions meet the highest quality standards. \n \nKey Responsibilities: \n \nDesign, implement, and manage CI/CD pipelines using Jenkins to streamline development, testing, and deployment processes. \n \nDevelop and maintain infrastructure as code using tools like Terraform, Ansible, or similar technologies. \n \nDeploy, manage, and scale applications using Kubernetes and other container orchestration platforms. \n \nUtilize cloud platforms (AWS, Azure, Google Cloud Platform) for infrastructure and application deployment. \n \nAutomate deployment processes to ensure efficient and reliable releases. \n \nWrite and maintain scripts in Python or Java for various automation tasks. \n \nCollaborate with development, QA, and operations teams to ensure seamless integration and delivery of solutions. \n \nPerform product testing to validate functionality, performance, and reliability of solutions. \n \nTroubleshoot and resolve issues related to application and infrastructure performance. \n \nMonitor system performance, identify bottlenecks, and propose optimizations. \n \nEnsure security and compliance standards are maintained throughout the development and deployment processes. \n \nStay up-to-date with the latest industry trends and technologies to continually improve our DevOps practices. \n \nQualifications: \n \nProven experience as a DevOps Engineer or similar role. \n \nStrong background in CI/CD using Jenkins. \n \nHands-on experience with infrastructure as code (IaC) tools such as Terraform or Ansible. \n \nProficiency in container technologies like Docker and orchestration platforms like Kubernetes. \n \nSolid understanding of cloud platforms (AWS, Azure, Google Cloud Platform). \n \nProgramming skills in Python or Java. \n \nExperience with deployment automation. \n \nGood understanding of Red Hat Enterprise Linux (RHEL). \n \nFamiliarity with vCenter API. \n \nExperience in product testing and quality assurance practices. \n \nStrong problem-solving skills and attention to detail. \n \nExcellent communication and collaboration abilities. \n \nAbility to work independently and as part of a team in a fast-paced environment. \n \nSkills \n \nAutomation and Testing \n \nContainer Technologies on Linux \n \nDEV-OPS \n \nInfra As Code \n \nLinux/RHEL OS \n \nPython /Java \n"
    },
    "cf9902a8-235b-4adb-a9d0-6f1c25688174": {
        "title": "Copado Devops Engineer",
        "location": "Remote",
        "company": "MDMS Recruiting",
        "link": "https://www.dice.com/job-detail/cf9902a8-235b-4adb-a9d0-6f1c25688174",
        "isApplied": null,
        "description": "Copado Devops Engineer \n \nLocation: Remote (EST), W2, or Self Inc \n \nDuration: 12 months + \n \nJob description: \n \n5+ years  experience in Salesforce development \n \n3+ years  experience in Copado management \n \n3+ years  experience in DevOps \n \nCommunicates with business teams on Salesforce \n \nOnboard Salesforce projects onto Copado DevOps \n \nSupports operational tasks around Copado \n \nProvide support on usage, training, and incidents \n \nDaily task: \n \nDesign and implement DevOps pipelines for Salesforce \n \nResolve customer support tickets \n \nMigration/feature planning and implementation of Copado \n"
    },
    "0b3d9c25-f8b5-4b33-b2aa-5af756d26a72": {
        "title": "Devops Engineer",
        "location": "Atlanta, Georgia, USA",
        "company": "Raas Infotek LLC",
        "link": "https://www.dice.com/job-detail/0b3d9c25-f8b5-4b33-b2aa-5af756d26a72",
        "isApplied": false,
        "description": "DevOps Engineer(AWS/Azure) \n \nExp - 10+ \n \nPosition Responsibilities: \n \nBuild, configure, and maintain data pipelines and data assets in ElasticSearch. \n \nDevelop, implement, and maintain data flows in Apache NiFi following best practices. \n \nCreate vault policies and assess vault tokens using HashiCorp Vault. \n \nBuild, configure, and maintain messaging platforms using IBM MQ and RabbitMQ. \n \nBecome a subject-matter expert on your assigned software packages. \n \nGuide and mentor associate-level team members. \n \nMinimum Requirements: \n \nBachelor's degree in Information Technology or related field. \n \n3+ years as a DevOps engineer or in a similar software engineering role. \n \nSkilled in HashiCorp products, ElasticSearch, IBM MQ, RabbitMQ, Apache NiFi and/or Python. \n \nExperience with integration and automation tools Azure DevOps and Git is a plus. \n"
    },
    "71c0a990-5fac-4bed-ad07-44917e1aee2c": {
        "title": "Lead DevOps Engineer",
        "location": "Austin, Texas, USA",
        "company": "Hectadata LLC",
        "link": "https://www.dice.com/job-detail/71c0a990-5fac-4bed-ad07-44917e1aee2c",
        "isApplied": false,
        "description": "Job Role: Lead DevOps Engineer \n \nJob Location: Austin, Texas \n \nJob Description: \n \nShould have experience in DevOps/Cloud Technologies (AWS) \n \nShould be well versed in Terraform & Cloud Formation \n \nShould be well versed on Containerization (Docker, Kubernetes) \n \nShould have good hands on experience in Python \n \nShould have strong understanding of Networking fundamentals \n \nShould have strong understanding of Certificate Management \n \nGood Debugging & Troubleshooting skills \n \nProactive and Willing to learn and ramp up in new areas \n \nProvide Continuous improvement ideas \n \nGood Communication skills \n"
    },
    "29469fd2-6ef5-45a1-97cc-e12393b3247a": {
        "title": "Linux DevOps Engineer",
        "location": "Plano, Texas, USA",
        "company": "Collabera LLC",
        "link": "https://www.dice.com/job-detail/29469fd2-6ef5-45a1-97cc-e12393b3247a",
        "isApplied": null,
        "description": "Must Haves: \n \n3-5 years of experience in Linux system administration with a focus on automation. \n \nExperience with On Prem servers is a non-negotiable must have. \n \nJenkins, Artifactory Skills are a must have. \n \nExperience with DevOps methodologies and tools (CI/CD pipelines) \n \nStrong scripting skills in Python for automation tasks. \n \nWorking knowledge of containerization technologies (Docker, Kubernetes) (a plus). \n \nUnderstanding of security best practices for Linux systems. \n \nExcellent communication and collaboration skills. \n"
    },
    "14104ddc-192b-49ba-bf50-cde603b9dc28": {
        "title": "Senior Devops Architect",
        "location": "Chicago, Illinois, USA",
        "company": "Stellent IT LLC",
        "link": "https://www.dice.com/job-detail/14104ddc-192b-49ba-bf50-cde603b9dc28",
        "isApplied": null,
        "description": "Job Title:- DevOps Architect \n \nLocation: Hybrid Chicago,IL (local only) \n \nC2C \n \nInterview Mode: Virtual Interview \n \nLast 4 SSN and MM/DD required.. \n \nGenuine 1 year old with good connections LinkedIn with profile picture required \n \nTop Skill Set: \n \n1. GitHub Actions are Mandatory (GitHub Repositories is NOT what he's looking for).Git or Git Labs is NOT acceptable. \n2. Expert in Azure. Application deployment and Infrastructure. \n3. Terraforms \n4. Docker \n5. Kubernetes \nTeam is 30 people. Not looking to train anyone in GitHub Actions. They must know it. \nThis is an architect level position, must provide solutions. Should be hands on as well. \nCertifications is nice but not mandatory. \nJava is 80%, React is 10%, 10% other languages. \nJob Description: \n \nSkills and Experience: \n \n1) Bachelor or master's degree in Computer Science or equivalent. \n2) 10+ years of progressive experience in DevSecOps including infrastructure and application deployments preferably in Azure. \n3) Must be capable of designing efficient, maintainable and secure DevOps solutions using GitHub actions, Azure. Terraform experience would be a huge plus. \n4) Ability to drive conversations with multiple stake-holders in design, development and adoption of DevOps solutions. \n5) Strong development background with one or more major programming languages     Java, JavaScript, Python, C# etc. \n6) In depth knowledge of software development lifecycle and methodologies including Waterfall, SCRUM, Kanban. \n7) 4+ years of hands on experience with creating YAML based automation workflows for DevSecOps CI/CD pipelines and Infrastructure as Code (IaC) pipelines using GitHub actions. \n8) 4+ years of hands on experience with deploying infrastructure using Terraform and various types of applications in Azure including Web Apps, Function Apps, AKS, Azure Container Apps. \n9) Ability to create yml based CI/CD workflows with integrations to scanning and testing tools such as SonarQube, Checkmarx etc. \n10) In-depth knowledge and experience in handling various package managers/types     Maven, Gradle, NuGet, PyPi, and NPM etc from CI/CD perspective. \n11) Working knowledge of ServiceNow for change, release and incident management, CMDB and APM. \n12) Excellent hands on experience working with SQL, MS SQL Server, Azure SQL and PostgreSQL \n13) Proficiency in Linux environment and Bash scripting. \n14) Excellent analytical and problem solving skill. \n15) Excellent presentation skills with ability to communicate with technical and non-technical people. \n16) Must be proficient in modelling/creating design diagrams, flow charts using MS Visio/Miro Boards. \n17) Hands on experience with one or more configuration management tools - Chef, Puppet, and Ansible \n18) Certification in any DevOps platform would be a plus \nResponsibilities: \n \n1) Design and implement complex DevOps and related workflows involving multiple platforms/tools using GitHub Actions and Azure. \n2) Work on complex enterprise-wide initiatives/programs spanning multiple divisions/business units. \n3) Review and optimize existing DevOps configurations for smooth operations and enhanced developer experience. \n4) Optimize DevOps solutions for better developer experience and minimize operational overhead. \n5) Create and maintain DevOps CI/CD pipelines for infrastructure provisioning, application deployment and database changes using Terraform, ARM templates and GitHub Actions. \n6) Integrate GitHub action workflows with SAST/SCA tools including but not limited to     Checkmarx One SCA, Checkmarx SAST, SonarQube . \n7) Troubleshoot CI/CD pipeline runs and put in permanent solutions for any recurring issues. \n8) Integrate GitHub action workflows with ServiceNow and perform read/write operations. \n9) Guide application teams on using CI/CD and IaC pipelines efficiently. \nComments for Suppliers: \n \nMust be and expert of Azure (Infra and Apps) and GitHub Actions \nSr. IT Technical Recruiter \n \nPhone:- \n \nEmail: \n \nGtalk: \n \nLinkedin id:- \n"
    },
    "83205c67-b71f-4d46-8d1f-bf67f472d75d": {
        "title": ".NET Developer with Azure Devops",
        "location": "Windsor charter Township, Michigan, USA",
        "company": "Sryven",
        "link": "https://www.dice.com/job-detail/83205c67-b71f-4d46-8d1f-bf67f472d75d",
        "isApplied": "no",
        "description": "Position: .NET Developer with Azure Devops \n \nLocation: Dimondale, MI (Hybrid 2 days a week in office) \n \nDuration: 12 Months with possible extension \n \nResponsibilities: \n \nWork directly with customers to develop requirements for application development. \n \nCreate functional and technical designs and documentation. \n \nDevelop applications using Microsoft Visual Studio, Azure DevOps, C#, .NET, MVC, and JavaScript. \n \nPerform data access and manipulation using queries, stored procedures, and Entity Framework. \n \nDevelop secure applications and system security plans. \n \nCreate and execute test plans, test suites, and test cases; experience with ADO test plans is a plus. \n \nCollaborate with team members and stakeholders to ensure successful project delivery. \n \nAdhere to best practices and standards in software development and security. \n \nTop Skills & Years of Experience: \n \nExperience working directly with customers to develop requirements for application development. \n \nExperience creating functional and technical designs and documentation. \n \nExperience developing applications using Microsoft Visual Studio/Azure DevOps/C#/ .NET/MVC/JavaScript. \n \nExperience with data access and manipulation including queries, stored procedures, and Entity Framework. \n \nExperience developing secure applications and system security plans. \n \nExperience developing and executing test plans/suites/cases (ADO test plans are a plus). \n \nRequired Qualifications: \n \nProven experience in application development and working with customers to gather requirements. \n \nStrong background in Microsoft Visual Studio, Azure DevOps, C#,.NET, MVC, and JavaScript. \n \nProficiency in data access and manipulation, including using queries, stored procedures, and the Entity Framework. \n \nExpertise in developing secure applications and creating system security plans. \n \nDemonstrated ability to develop and execute comprehensive test plans. \n \nExcellent communication skills and the ability to collaborate with team members and stakeholders. \n \nInterview Process: \n \nThe initial interview will be conducted virtually via MS Teams. \n \nSecond-round interviews will be conducted onsite at the Dimondale, MI, office. \n"
    },
    "1e88ef69-9d2c-4586-8ae1-ba1f2acb1535": {
        "title": "DevOps Solution Architect with Python (\"Ex Apple\")",
        "location": "Austin, Texas, USA",
        "company": "CCIT",
        "link": "https://www.dice.com/job-detail/1e88ef69-9d2c-4586-8ae1-ba1f2acb1535",
        "isApplied": "no",
        "description": "DevOps Solutions Architect with Python experience \n \nLocation   Austin, TX \n \nHybrid (3 days a week onsite) \n \nRole/s Requested: \n \nLook for only product base experience profiles (Ex Apple Profiles is always prefer) \n \nCustomer is looking for an experienced DevOps Solutions Architect with expertise in Python to join our team. The ideal candidate will have a strong background in designing and implementing scalable and efficient cloud-based systems. The candidate will be responsible for bridging the gap between software development and operations by creating and maintaining infrastructure, automating deployment processes, and ensuring the smooth operation of our cloud-based applications. \n \nResponsibilities: \n \nDesign and implement cloud-based systems on AWS \n \nDevelop automation scripts using Python \n \nCollaborate with development teams to ensure smooth deployment of applications \n \nEnsure scalability, security, and efficiency of cloud-based systems \n \nImplement DevOps best practices and tools \n \nRequirements: \n \n5+ years of experience in DevOps or a related field \n \nStrong expertise in Python \n \nExperience with cloud-based systems (AWS or Azure) \n \nStrong understanding of DevOps principles and tools \n"
    },
    "2b1332c1-8305-4146-9154-6eeb2ee06036": {
        "title": ".NET Developer",
        "location": "Michigan Center, Michigan, USA",
        "company": "Advent Global Solutions, Inc.",
        "link": "https://www.dice.com/job-detail/2b1332c1-8305-4146-9154-6eeb2ee06036",
        "isApplied": null,
        "description": "Job title: .NET Developer \n \nLocation: Dimondale, MI \n \nDuration: 1+ Years \n \nLocal DL or State ID Must or it will not be submitted to client. \n \n***Hybrid 2 days onsite*** \n \nJob Description: \n \nIn the analyst role, the Programmer Analyst is responsible for gathering and documenting clear, unambiguous, and testable business requirements from the client, understanding the business requirements thoroughly to communicate business need and system functionality to technical and non-technical stakeholders, project team members, and the user community. The resource will be responsible for working with the project team and stakeholders to examine existing and future-state business processes, data, and systems. This information is used to guide the gathering of business requirements as they relate to the desired system functionality. \n \nIn the programmer role, the Programmer Analyst is responsible for planning, developing, testing, and documenting computer programs, applying knowledge of programming techniques and computer systems. \n \nAnalyst Responsibilities \n \nDocument business requirements that are clear, unambiguous, testable, and satisfy the business need in accordance with standard templates and adherence to DTMB and Treasury policies, standards, and guidelines. \n \nFacilitate requirement gathering meetings to identify impacted business processes and document the project business requirements. Attendees include relevant project team members and stakeholders as identified in the Communication Plan. \n \nAdhere to the project schedule by developing and maintaining the project backlog during Agile projects and working with the product owner to set priority throughout the duration of project. \n \nUnderstand project scope and actively monitor requirements process to maintain adherence to the objectives set for the project. \n \nUnderstand high-level information governance objectives and ensure appropriate Stakeholder inclusion and/or awareness regarding data requirements. \n \nResolution of critical IT issues as it pertains to the BA role. \n \nUnderstand project specific benefits and related impact of changes to project scope or business requirements. \n \nEnsure SEM deliverables for the project that are a responsibility of the BA are completed, reviewed, and approved in alignment with area processes. \n \nWork directly with project team including user interface/user experience (UI/UX) designers, tech leads, solution architects, database administrators, developers, QA testers, and technical writers to ensure understanding of the requirements, functionality, size, and scalability of the IT solution. \n \nWork with security team to develop system security plans (SSPs). \n \nProgrammer Responsibilities \n \nPossess knowledge and experience of advanced principles, theories, techniques, and methods in the development and design of web applications. \n \nWork as a team and individually on projects and tasks using Agile and/or traditional project management methodologies. \n \nParticipate in project review meetings and project workgroups. \n \nPresents the information gathered to the Project Review Board and/or Project Sponsors during project review meetings, project workgroups and to the Technical Review Board providing clarification and answers to questions. \n \nCreate, update, and maintain systems and IT programs documentation, including but not limited to system and functional specifications. \n \nDraft technical models that capture requirements of data elements, and design data elements to best meet application needs. \n \nDesign and develop software code based on reusability, approved architecture/design, and in compliance with security (SADLC) and other applicable State of Michigan standards, policies, and procedures including Americans with Disabilities (ADA) compliance. \n \nMitigate application-level security risks, and remediate vulnerabilities as soon as identified. \n \nParticipate and provide input for structured walk throughs, code reviews, and stage exits. \n \nStrictly follow configuration management procedures as defined by the development team. \n \nFollow change management procedures as defined by the State of Michigan Center for Excellence and provide input in execute change management. \n \nSupport project documentation requirements by following System Engineering - SUITE standards for Agile and Traditional methodologies as applicable. \n \nPerform application unit, string, and integrated testing to ensure compliance with the business and technical requirements. \n \nDevelop system/module level test scripts, test plans, and test cases required to support the execution of unit, string, and integrated system testing activities. \n \nAnalyze and document identified problems to determine root cause and provide root cause analysis reports. \n \nDevelop user manuals and conduct training for users. \n \nEvaluate requests for modifications and enhancements for impact on existing project and applications. \n \nRequirements \n \nExperience working directly with customers to develop requirements for application development. \n \nExperience creating functional and technical designs and documentation. \n \nExperience developing applications using Microsoft Visual Studio/Azure DevOps/C#/.NET/MVC/JavaScript. \n \nExperience with data access and manipulation including queries/stored procedures/Entity Framework. \n \nExperience developing secure applications and system security plans. \n \nExperience developing and executing test plans/suites/cases. ADO test plans are a plus. \n"
    }
}